{
  "diagnostic" :
  {
    "icone" : "malade.svg",
    "titre" : "Vous faites face à un problème: baisse de production, mortalité, mauvais état",
    "soustitre" : "Vous avez besoin de confirmer un diagnostic.",
    "qui" :
    {
      "p1" : "Les animaux malades ou en mauvais état.",
      "p2" : "Il est aussi possible de faire un second lot avec les animaux en bon état",
      "p3" : ""
    },
    "quand" :
    {
      "p1" : "Au moment de la constatation du problème.",
      "p2" : "",
      "p3" : ""
    }
  },
  "bilan" :
  {
    "icone" : "bilan.svg",
    "titre" : "Vous souhaitez évaluer le niveau d'infestation du troupeau en fin de saison de pâture",
    "soustitre" : "Il s'agit d'évaluer les mesures de prévention mises en place ou de faire un bilan avant un éventuel traitement",
    "qui" :
    {
      "p1" : "Il est indispensable de faire au moins trois lots de 5 animaux sur la base suivante:",
      "p2" : "Les animaux maigres ou en mauvais état, les animaux bien portants, les primipares (agnelles, anthenaises, génisses d'un an ou de deux ans)",
      "p3" : "D'autres lots sont envisageables en fonction des pratiques de pâturage."
    },
    "quand" :
    {
      "p1" : "En fin de saison de pâture, au début de l'automne",
      "p2" : "Dès que les premiers froids arrivent, les larves de strongle ne finissent pas leur développement et restent enkystées dans la muqueuse",
      "p3" : "Elles sont indétectables à la coproscopie. Il est donc inutile d'attendre la rentrée en bâtiment pour faire ce bilan."
    }
  },
  "suivi" :
  {
    "icone" : "suivi.svg",
    "titre" : "Vous voulez suivre la dynamique d'infestation en cours de saison de pâturage par les strongles",
    "soustitre" : "Afin de mieux connaître la spécificité de votre élevage ou d'évaluer les moments critiques.",
    "qui" :
    {
      "p1" : "Il faut faire au moins deux ou trois lots a priori de 5 animaux:",
      "p2" : "Un premier lot peut être constitué des fortes productrices, souvent plus sensibles.",
      "p3" : "Un deuxième lot sera fait avec les jeunes (agneaux, génisses) et/ou les primipares (agnelles, chevrettes)."
    },
    "quand" :
    {
      "p1" : "Une première analyse peut être faite à la mise à l'herbe si aucun bilan n'a été fait l'année d'avant. Sinon, un premier prélèvement fin mai permet d'évaluer la montée de l'infestation.",
      "p2" : "Une seconde analyse est à réaliser durant le mois de juillet, moment qui correspond au premier pic d'infestation",
      "p3" : "Une troisième et dernière analyse sera réalisée à l'automne."
    }
  },
  "haemonchus" :
  {
    "icone" : "taux_haem.svg",
    "titre" : "Vous voulez connaître la proportion d'Haemonchus contortus (strongle hautement pathogène des petits ruminants) dans votre troupeau",
    "soustitre" : "La connaissance de ce taux d'haemonchus vous permettra une analyse plus fine du risque encouru par les animaux.",
    "qui" :
    {
      "p1" : "Il faut faire un lot de 5 animaux:",
      "p2" : "En choisissant a priori des animaux susceptibles d'être infestés: maigres, anémiés, mauvais état général."
    },
    "quand" :
    {
      "p1" : "C'est une analyse à réaliser en fin de saison de pâturage, au début de l'automne",
      "p2" : "Il est possible de faire cette analyse à n'importe quel autre moment si on observe des signes de parasitisme, notamment à haemonchus (anémie)"
    }
  },
  "resistance" :
  {
    "icone" : "test_resistance.svg",
    "titre" : "Vous soupçonnez la présence dans votre troupeau de strongles résistants aux anthelminthiques",
    "soustitre" : "Lors du dernier traitement réalisé, l'état des animaux ne s'est pas amélioré.",
    "qui" :
    {
      "p1" : "Le nombre de lots dépend du nombre de produits que vous voulez évaluer.",
      "p2" : "Il faut au minimum un lot témoin qui ne recevra aucun traitement.",
      "p3" : "Et autant de lots traités qu'il y a de produits à tester."
    },
    "quand" :
    {
      "p1" : "Une première analyse est faite le jour du traitement.",
      "p2" : "Une seconde analyse est réalisée 10 jours après le traitement.",
      "p3" : "Un calcul permet de connaitre le taux de réduction d'excrétion fécale et donc la présence éventuelle d'une résistance."
    }
  },
  "chevaux" :
  {
    "icone" : "cas_equides.svg",
    "titre" : "Cas particulier des chevaux et des ânes",
    "soustitre" : "Dans le cas des équidés, il est souvent intéressant de privilégier des analyses individuelles."
  },
  "vetos" :
  {
    "icone" : "veto.svg",
    "titre" : "Dans tous les cas, n'hésitez pas à en discuter avec votre vétérinaire.",
    "soustitre" : "Cela vous permettra d'adapter ces préconisations à votre élevage. Vous pouvez aussi nous contacter."
  }
}
