app/Http/Controllers/Api/DonneesController.php

select * from `LAB_especes`
---
  public function especes()
  {
    return json_encode(Espece::all());

select * from `LAB_ages` where `espece_id` = '5'
select * from `LAB_icones` where `LAB_icones`.`id` in (33, 34)
---
  public function ages($espece_id)
  {
    return json_encode(Age::where('espece_id', $espece_id)->with('icone')->get());

select * from `LAB_observations` inner join `LAB_espece_observation` on `LAB_espece_observation`.`observation_id` = `LAB_observations`.`id` where `LAB_espece_observation`.`espece_id` = '2' order by `LAB_observations`.`ordre` asc
---
  public function observationSelonEspece($espece_id)
  {

    $observations = DB::table('observations')
                     ->join('espece_observation', 'espece_observation.observation_id', "=", 'observations.id')
                     ->where('espece_observation.espece_id', $espece_id)
                     ->orderBy('observations.ordre')->get();

select * from `LAB_observations` inner join `LAB_age_observation` on `LAB_age_observation`.`observation_id` = `LAB_observations`.`id` where `LAB_age_observation`.`age_id` = '2' order by `LAB_observations`.`ordre` asc
---
  public function observationSelonAge($age_id)
  {
    $observations = DB::table('observations')
                     ->join('age_observation', 'age_observation.observation_id', "=", 'observations.id')
                     ->where('age_observation.age_id', $age_id)
                     ->orderBy('observations.ordre')->get();

select * from `LAB_exclusions` where `observation_id` = '7' and `espece_id` = '2' and `age_id` is null
select * from `LAB_exclusionsanaacte` where `observation_id` = '7' and `espece_id` = '2' and `age_id` is null
---
      // On la recherche dans la base de donnée
      $observation = Observation::find($observation_id);
      // On recherche les anatypes exclus par cette observation
      $exclusions = Exclusion::where('observation_id', $observation_id)->where('espece_id', $datas['espece'])->where('age_id', $age_id)->get();
      // On recherche les anaactes exclus
      $anaactes_exclus = ExclusionsAnaacte::where('observation_id', $observation_id)->where('espece_id', $datas['espece'])->where('age_id', $age_id)->get();

select * from `LAB_anaactes` where `anatype_id` in (1, 1, 3, 4, 5)
---
  $anatypes_retenus = $liste_anatypes->intersect($liste_anatypes_espece_age)->countBy()->sort()->reverse()->slice(0,2)->keys();
// dd($anatypes_retenus);
  //Constitution de la liste des anaactes à partir des anatypes plus de la liste d'exclusion spécifique des anaactes
  $anaactes = DB::table('anaactes')->whereIn('anatype_id', $liste_anatypes)->get();