app/Http/Controllers/Technique/AnalysesController.php

select * from `LAB_anatypes` where `estAnalyse` = 1
select * from `LAB_especes`
select * from `LAB_ages`
select * from `LAB_categories`
---
    public function choisir()
    {
      session()->put('choisirFirst', true);

      // $anaactes =Anaacte::where('estAnalyse', true)->groupBy('anatype_id')->orderBy('num')->get();
      $anatypes = Anatype::where('estAnalyse', true)->get();

      $choix = $this->litJson('choixAnalyse');

//       foreach($choix as $esp => $details) {
//         foreach($details as $item) {
//           foreach ($item->signes as $signe) {
//             foreach($signe->anatypes as $anatype) {
//               dump($anatype);
//             }
//           }
//         }
//       }
// dd('');
      return view('extranet.analyses.choisir', [
        'menu' => $this->menu,
        'route' => 'analyses.choisir',
        'analysesProgress' => $this->litJson('analysesProgress'),
        'especes' => Espece::all(),
        'ages' => Age::all(),
        'categories' => Categorie::all(),
        'anatypes' => $anatypes,
        'choix' => $choix,
      ]);