app/Http/Controllers/Technique/ParasitismeController.php

select * from `LAB_motclefs`
select * from `LAB_blogs` order by `created_at` desc limit 1
---
      public function accueil()
      {
        $fondamentaux = $this->litJson('fondamentaux'); // articles de fond plus longs qu'un blog et listés dans le menu latéral


        $motclefs = Motclef::all();

        $derniers_blogs = Blog::orderBy('created_at', 'desc')->get(); // pour afficher les 5 derniers blogs dans le menu latéral