app/Http/Controllers/AccueilController.php

    public function veterinaires()
    {
      $anatypes = Anatype::all();
---
select * from `LAB_anatypes`