app/Http/Controllers/ExpressController.php

  public function tarifs()
  {

    return view('extranet.analyses.tarifs', [
      'menu' => $this->menu,
      'anaactes' => Anaacte::where('estActif', true)->get(),
      'anatypes' => Anatype::all(),
---
select * from `LAB_anaactes` where `estActif` = 1
select * from `LAB_anatypes`

  public function envoiKit()
  {

    $cout_kit = Anaacte::select('pu_ht')->where('abbreviation', 'kit envoi')->first()->pu_ht;
// TODO: problème avec la personne
    return view('extranet.analyses.enpratique.envoiKit', [
      'menu' => $this->menu,
      'pays' => $this->litJson('pays'),
      'user' => auth()->user(),
      'personne' => $this->personne(auth()->user()),
      'cout_kit' => $cout_kit,
      'especes' => Espece::all(),
    ]);
---
select * from `LAB_anaactes`