app/Http/Controllers/Analyses/AnaacteController.php

select * from `LAB_anaactes` where `estAnalyse` = 1 order by `num` asc
---
    public function index()
    {
      $anaactes = Anaacte::where('estAnalyse', true)->orderBy('num', 'asc')->get();

select * from `LAB_anatypes`
select * from `LAB_icones`
---
     public function create()
    {
      return view('admin.anaactes.anaacteCreate', [
        'menu' => $this->menu,
        'anatypes' => Anatype::all(),
        'icones' => Icone::all()->sortBy('nom'),

select * from `LAB_icones`
select * from `LAB_tvas`
---
    public function edit($id)
    {
      $anaacte = Anaacte::find($id);

      return view('admin.anaactes.anaacte', [
        'menu' => $this->menu,
        'icones' => Icone::all()->sortBy('nom'),
        'anaacte' => $anaacte,
        'tvas' => Tva::all(),
      ]);