app/Http/Controllers/Analyses/AnatypeController.php

select * from `LAB_anatypes`
---
    public function index()
    {
      $anatypes = Anatype::all();