app/Http/Controllers/Labo/DemandeController.php

select * from `LAB_demandes`
---
    public function index()
    {
      $demandes = Demande::all();