app/Fournisseurs/ListeDemandesFournisseur.php

  public function creeliste($demandes)
  {
    $this->liste = collect();

    foreach ($demandes as $demande) {

      $description = [];

      if (isset($demande->user)) {

        $eleveur = $this->lienFactory($demande->user->id, ucfirst($demande->user->name), 'eleveurAdmin.show', 'affiche_detail_eleveur');

      }

      else {

        $anonyme = User::find(0);
---
select * from `LAB_users` where `LAB_users`.`id` = 12 limit 1